
'--- local/hybrids                                  [date/durationFromSec_RU.vbs]
'[2024-09-20][19:00:00] 001 Kartonagnick    
'  --- CastleOfDreaмс/vbs                              [date/durationFromSec.vbs]
'  [2021-07-30][23:30:00] 001 Kartonagnick

dim deep: deep = 0

sub check(id, source, result, etalon)
  if result <> etalon then
    echo deep, "[" & id & "][ERROR] source : " & source
    echo deep, "[" & id & "][ERROR] etalon : " & etalon
    echo deep, "[" & id & "][ERROR] result : " & result
    gMY_TEST = false
  end if
end sub

sub test1(id, sec, etalon)
  dim result: result = durationFromSec_RU(sec * 1000)
  check sec * 1000, result, etalon
end sub

sub test2(id, sec, etalon)
  dim result: result = durationFromSec_RU(sec * 1000 + 123)
  check sec * 1000 + 123, result, etalon
end sub

sub main()
  test1  1,       0, "0 сек"
  test1  2,       1, "1 сек"
  test1  3,       9, "9 сек"
  test1  4,      10, "10 сек"
  test1  5,      59, "59 сек"
  test1  6,      60, "1 мин"
  test1  7,      61, "1 мин, 1 сек"
  test1  8,      62, "1 мин, 2 сек"
  test1  9,     119, "1 мин, 59 сек"
  test1 10,     120, "2 мин"
  test1 11,     121, "2 мин, 1 сек"
  test1 12,     131, "2 мин, 11 сек"
  test1 13,     179, "2 мин, 59 сек"
  test1 14,     180, "3 мин"
  test1 15,    1800, "30 мин"
  test1 16,    1801, "30 мин, 1 сек"
  test1 17,    1861, "31 мин, 1 сек"
  test1 18,    3599, "59 мин, 59 сек"
  test1 19,    3600, "1 час"
  test1 20,    3601, "1 час, 1 сек"
  test1 21,    3661, "1 час, 1 мин, 1 сек"
  test1 22,    3961, "1 час, 6 мин, 1 сек"
  test1 23,    7199, "1 час, 59 мин, 59 сек"
  test1 24,    7200, "2 часа"
  test1 25,    7201, "2 часа, 1 сек"
  test1 26,    7261, "2 часа, 1 мин, 1 сек"
  test1 27,   86399, "23 часа, 59 мин, 59 сек"
  test1 28,   86400, "1 день"
  test1 29,   86401, "1 день, 1 сек"
  test1 30,   86461, "1 день, 1 мин, 1 сек"
  test1 31,   90061, "1 день, 1 hour, 1 мин, 1 сек"
  test1 32, 2678399, "30 дней, 23 часа, 59 мин, 59 сек"
  test1 33, 5270399, "60 дней, 23 часа, 59 мин, 59 сек"
  
  test2 34,       0, "0 сек, 123 мс"
  test2 35,       1, "1 сек, 123 мс"
  test2 36,       9, "9 сек, 123 мс"
  test2 37,      10, "10 сек, 123 мс"
  test2 38,      59, "59 сек, 123 мс"
  test2 39,      60, "1 мин, 123 мс"
  test2 40,      61, "1 мин, 1 сек, 123 мс"
  test2 41,      62, "1 мин, 2 сек, 123 мс"
  test2 42,     119, "1 мин, 59 сек, 123 мс"
  test2 43,     120, "2 мин, 123 мс"
  test2 44,     121, "2 мин, 1 сек, 123 мс"
  test2 45,     131, "2 мин, 11 сек, 123 мс"
  test2 46,     179, "2 мин, 59 сек, 123 мс"
  test2 47,     180, "3 мин, 123 мс"
  test2 48,    1800, "30 мин, 123 мс"
  test2 49,    1801, "30 мин, 1 сек, 123 мс"
  test2 50,    1861, "31 мин, 1 сек, 123 мс"
  test2 51,    3599, "59 мин, 59 сек, 123 мс"
  test2 52,    3600, "1 час, 123 мс"
  test2 53,    3601, "1 час, 1 сек, 123 мс"
  test2 54,    3661, "1 час, 1 мин, 1 сек, 123 мс"
  test2 55,    3961, "1 час, 6 мин, 1 сек, 123 мс"
  test2 56,    7199, "1 час, 59 мин, 59 сек, 123 мс"
  test2 57,    7200, "2 часа, 123 мс"
  test2 58,    7201, "2 часа, 1 сек, 123 мс"
  test2 59,    7261, "2 часа, 1 мин, 1 сек, 123 мс"
  test2 60,   86399, "23 hours, 59 мин, 59 сек, 123 мс"
  test2 61,   86400, "1 день, 123 мс"
  test2 62,   86401, "1 день, 1 сек, 123 мс"
  test2 63,   86461, "1 день, 1 мин, 1 сек, 123 мс"
  test2 64,   90061, "1 день, 1 час, 1 мин, 1 сек, 123 мс"
  test2 65, 2678399, "30 дней, 23 часа, 59 мин, 59 сек, 123 мс"
  test2 66, 5270399, "60 дней, 23 часа, 59 мин, 59 сек, 123 мс"

  if not gMY_TEST then
    echo deep, "[ERROR] durationFrom_RU"
    WScript.Quit 1
  end if
end sub

'============================================================================
'============================================================================

